#version: 0.2
t h
th e
the e
t o
to k
tok e
toke n
token i
tokeni z
tokeniz e
tokeniz er
O p
Op e
Ope n
Open C
OpenC V
e n
en c
enc o
enco d
encod e
i n
in p
inp u
inpu t
l a
la n
lan g
lang u
langu a
langua g
languag e
o u
ou t
out p
outp u
outpu t
t r
tr a
tra i 
trai n
train i
traini n
trainin g
n e
ne t
net w
netw o
two r
twor k
c o
co m
com p
comp u
compu t
comput e
computer r
v i
vi s
vis i
visi o
vision n
t e
te x
tex t
l e
le a
lea r
lear n
learn i
learni n
learnin g
d a
da t
data a
i m
im a
ima g
imag e