{
    "!": 0,
    "\"": 1,
    "#": 2,
    "$": 3,
    "%": 4,
    "&": 5,
    "'": 6,
    "(": 7,
    ")": 8,
    "*": 9,
    "+": 10,
    ",": 11,
    "-": 12,
    ".": 13,
    "/": 14,
    "0": 15,
    "1": 16,
    "2": 17,
    "3": 18,
    "4": 19,
    "5": 20,
    "6": 21,
    "7": 22,
    "8": 23,
    "9": 24,
    ":": 25,
    ";": 26,
    "<": 27,
    "=": 28,
    ">": 29,
    "?": 30,
    "@": 31,
    "A": 32,
    "B": 33,
    "C": 34,
    "D": 35,
    "E": 36,
    "F": 37,
    "G": 38,
    "H": 39,
    "I": 40,
    "J": 41,
    "K": 42,
    "L": 43,
    "M": 44,
    "N": 45,
    "O": 46,
    "P": 47,
    "Q": 48,
    "R": 49,
    "S": 50,
    "T": 51,
    "U": 52,
    "V": 53,
    "W": 54,
    "X": 55,
    "Y": 56,
    "Z": 57,
    "[": 58,
    "\\": 59,
    "]": 60,
    "^": 61,
    "_": 62,
    "`": 63,
    "a": 64,
    "b": 65,
    "c": 66,
    "d": 67,
    "e": 68,
    "f": 69,
    "g": 70,
    "h": 71,
    "i": 72,
    "j": 73,
    "k": 74,
    "l": 75,
    "m": 76,
    "n": 77,
    "o": 78,
    "p": 79,
    "q": 80,
    "r": 81,
    "s": 82,
    "t": 83,
    "u": 84,
    "v": 85,
    "w": 86,
    "x": 87,
    "y": 88,
    "z": 89,
    "{": 90,
    "|": 91,
    "}": 92,
    "~": 93,
    " ": 94,
    "th": 95,
    "he": 96,
    "in": 97,
    "er": 98,
    "an": 99,
    "re": 100,
    "on": 101,
    "at": 102,
    "en": 103,
    "nd": 104,
    "ti": 105,
    "es": 106,
    "or": 107,
    "te": 108,
    "of": 109,
    "ed": 110,
    "is": 111,
    "it": 112,
    "al": 113,
    "ar": 114,
    "st": 115,
    "to": 116,
    "nt": 117,
    "ng": 118,
    "se": 119,
    "ha": 120,
    "as": 121,
    "ou": 122,
    "io": 123,
    "le": 124,
    "ve": 125,
    "co": 126,
    "me": 127,
    "de": 128,
    "hi": 129,
    "ri": 130,
    "ro": 131,
    "ic": 132,
    "ne": 133,
    "ea": 134,
    "ra": 135,
    "ce": 136,
    "li": 137,
    "ch": 138,
    "ll": 139,
    "be": 140,
    "ma": 141,
    "si": 142,
    "om": 143,
    "ur": 144,
    "ca": 145,
    "el": 146,
    "ta": 147,
    "la": 148,
    "ns": 149,
    "di": 150,
    "for": 151,
    "the": 152,
    "and": 153,
    "ing": 154,
    "ion": 155,
    "you": 156,
    "are": 157,
    "this": 158,
    "that": 159,
    "have": 160,
    "with": 161,
    "from": 162,
    "they": 163,
    "will": 164,
    "would": 165,
    "there": 166,
    "their": 167,
    "what": 168,
    "about": 169,
    "which": 170,
    "when": 171,
    "make": 172,
    "like": 173,
    "time": 174,
    "just": 175,
    "know": 176,
    "people": 177,
    "year": 178,
    "your": 179,
    "good": 180,
    "some": 181,
    "could": 182,
    "them": 183,
    "than": 184,
    "then": 185,
    "look": 186,
    "only": 187,
    "come": 188,
    "over": 189,
    "think": 190,
    "also": 191,
    "back": 192,
    "after": 193,
    "use": 194,
    "two": 195,
    "how": 196,
    "our": 197,
    "work": 198,
    "first": 199,
    "well": 200,
    "OpenCV": 201,
    "computer": 202,
    "vision": 203,
    "image": 204,
    "processing": 205,
    "algorithm": 206,
    "model": 207,
    "learning": 208,
    "neural": 209,
    "network": 210,
    "training": 211,
    "data": 212,
    "input": 213,
    "output": 214,
    "token": 215,
    "tokenizer": 216,
    "encode": 217,
    "decode": 218,
    "language": 219,
    "text": 220,
    "<|endoftext|>": 221,
    "<|fim_prefix|>": 222,
    "<|fim_middle|>": 223,
    "<|fim_suffix|>": 224,
    "<|endofprompt|>": 225
  }