<unk>	0.0
<s>	0.0
</s>	0.0
the	-1.0
and	-1.2
for	-1.3
you	-1.4
are	-1.5
this	-1.6
that	-1.7
with	-1.8
have	-1.9
from	-2.0
they	-2.1
will	-2.2
would	-2.3
there	-2.4
their	-2.5
what	-2.6
about	-2.7
which	-2.8
when	-2.9
make	-3.0
##s	-3.1
##ing	-3.2
##ed	-3.3
##ly	-3.4
##er	-3.5
##ent	-3.6
##ion	-3.7
##tion	-3.8
##ation	-3.9
##able	-4.0
##ive	-4.1
##ize	-4.2
##al	-4.3
##ful	-4.4
##ous	-4.5
##ness	-4.6
##ity	-4.7
##ment	-4.8
OpenCV	-1.1
computer	-1.3
vision	-1.4
image	-1.5
processing	-1.6
algorithm	-1.7
model	-1.8
learning	-1.9
neural	-2.0
network	-2.1
training	-2.2
data	-2.3
input	-2.4
output	-2.5
token	-1.2
##iz	-2.5
##izer	-2.6
tokenizer	-1.1
encode	-1.3
decode	-1.4
language	-1.5
text	-1.6
detection	-1.7
feature	-1.8
extraction	-1.9
classification	-2.0
segmentation	-2.1
tracking	-2.2
recognition	-2.3
machine	-2.4
deep	-2.5
tion	-3.0
ing	-3.1
ized	-3.2
ize	-3.3
ers	-3.4
ed	-3.5
ate	-3.6
ates	-3.7
ating	-3.8
ness	-3.9
al	-4.0
ic	-4.1
ics	-4.2
ical	-4.3
ically	-4.4
ies	-4.5
y	-4.6
ive	-4.7
ively	-4.8
iveness	-4.9
able	-5.0
ability	-5.1
ment	-5.2
ments	-5.3
ful	-5.4
fully	-5.5
fulness	-5.6
less	-5.7
lessly	-5.8
lessness	-5.9
ish	-6.0
like	-6.1
ness	-6.2
hood	-6.3
ship	-6.4
ist	-6.5
ism	-6.6
ize	-6.7
ise	-6.8
ify	-6.9
fy	-7.0
ly	-7.1
ward	-7.2
wise	-7.3
ways	-7.4
fold	-7.5
most	-7.6
some	-7.7
any	-7.8
every	-7.9
no	-8.0
not	-8.1
un	-8.2
in	-8.3
im	-8.4
ir	-8.5
il	-8.6
dis	-8.7
mis	-8.8
non	-8.9
re	-9.0
over	-9.1
under	-9.2
super	-9.3
sub	-9.4
inter	-9.5
intra	-9.6
trans	-9.7
pre	-9.8
post	-9.9
ante	-10.0
anti	-10.1
auto	-10.2
bi	-10.3
co	-10.4
counter	-10.5
de	-10.6
en	-10.7
ex	-10.8
extra	-10.9
hyper	-11.0
il	-11.1
im	-11.2
in	-11.3
ir	-11.4
inter	-11.5
intra	-11.6
macro	-11.7
micro	-11.8
mid	-11.9
mis	-12.0
mono	-12.1
multi	-12.2
non	-12.3
omni	-12.4
out	-12.5
over	-12.6
poly	-12.7
post	-12.8
pre	-12.9
pro	-13.0
pseudo	-13.1
re	-13.2
retro	-13.3
self	-13.4
semi	-13.5
sub	-13.6
super	-13.7
supra	-13.8
sur	-13.9
syn	-14.0
trans	-14.1
tri	-14.2
ultra	-14.3
un	-14.4
under	-14.5
uni	-14.6
up	-14.7
a	-2.5
b	-2.6
c	-2.7
d	-2.8
e	-2.9
f	-3.0
g	-3.1
h	-3.2
i	-3.3
j	-3.4
k	-3.5
l	-3.6
m	-3.7
n	-3.8
o	-3.9
p	-4.0
q	-4.1
r	-4.2
s	-4.3
t	-4.4
u	-4.5
v	-4.6
w	-4.7
x	-4.8
y	-4.9
z	-5.0
A	-5.1
B	-5.2
C	-5.3
D	-5.4
E	-5.5
F	-5.6
G	-5.7
H	-5.8
I	-5.9
J	-6.0
K	-6.1
L	-6.2
M	-6.3
N	-6.4
O	-6.5
P	-6.6
Q	-6.7
R	-6.8
S	-6.9
T	-7.0
U	-7.1
V	-7.2
W	-7.3
X	-7.4
Y	-7.5
Z	-7.6
0	-3.0
1	-3.1
2	-3.2
3	-3.3
4	-3.4
5	-3.5
6	-3.6
7	-3.7
8	-3.8
9	-3.9
.	-4.0
,	-4.1
;	-4.2
:	-4.3
!	-4.4
?	-4.5
(	-4.6
)	-4.7
[	-4.8
]	-4.9
{	-5.0
}	-5.1
'	-5.2
"	-5.3
/	-5.4
\	-5.5
-	-5.6
_	-5.7
+	-5.8
=	-5.9
<	-6.0
>	-6.1
@	-6.2
#	-6.3
$	-6.4
%	-6.5
^	-6.6
&	-6.7
*	-6.8
~	-6.9
`	-7.0
|	-7.1
こん	-2.5
にち	-2.8
は	-1.5
世界	-1.2
hello	-2.0
world	-2.1
你好	-2.2
世界	-1.2
नमस्ते	-2.3
दुनिया	-2.4
مرحبا	-2.5
عالم	-2.6
bonjour	-2.7
monde	-2.8
hola	-2.9
mundo	-3.0
ciao	-3.1
mondo	-3.2
hallo	-3.3
welt	-3.4
olá	-3.5
mundo	-3.0
привет	-3.6
мир	-3.7