[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
the
and
for
you
are
this
that
with
have
from
they
will
would
there
their
what
about
which
when
make
##s
##ing
##ed
##ly
##er
##ent
##ion
##tion
##ation
##able
##ive
##ize
##ize
##al
##ful
##ous
##ness
##ity
##ment
OpenCV
computer
vision
image
processing
algorithm
model
learning
neural
network
training
data
input
output
token
##iz
##izer
tokenizer
encode
decode
language
text
detection
feature
extraction
classification
segmentation
tracking
recognition
machine
deep
convolutional
optimization
parameter
activation
function
layer
tensor
matrix
vector
scalar
kernel
filter
convolution
pooling
upsampling
batch
normalization
gradient
backpropagation
inference
prediction
accuracy
precision
recall
metrics
evaluation
validation
testing
deployment
pipeline
framework
library
source
code
implementation
interface
module
class
object
instance
method
property
attribute
value
type
system
hardware
software
development
integration
application
user
interface
experience
design
pattern
architecture
structure
component
service
platform
environment
cloud
edge
embedded
mobile
web
server
client
protocol
request
response
stream
buffer
memory
storage
file
disk
database
query
result
schema
table
record
field
key
value
index
search
sort
filter
aggregate
transform
convert
parse
format
serialize
deserialize
encode
decode
compress
decompress
encrypt
decrypt
hash
checksum
signature
validation
verification
authentication
authorization
permission
access
control
security
privacy
protection
compliance
regulation
standard
specification
requirement
constraint
condition
expression
statement
block
loop
iteration
recursion
function
procedure
routine
module
package
namespace
scope
visibility
public
private
protected
inheritance
polymorphism
abstraction
encapsulation
interface
implementation
override
overload
template
generic
typed
dynamic
static
constant
variable
parameter
argument
return
yield
throw
catch
try
except
finally
error
exception
warning
logging
debug
trace
profile
performance
optimization
efficiency
throughput
latency
response
time
real-time
batch
processing
parallel
concurrent
threaded
asynchronous
synchronous
blocking
non-blocking
event
driven
reactive
functional
procedural
object-oriented
imperative
declarative
script
compile
interpret
transpile
build
link
execute
deploy
install
configure
manage
monitor
analyze
report
visualize
present
display
render
draw
paint
animate
transition
transform
scale
rotate
translate
perspective
projection
mapping
coordinate
point
line
curve
surface
volume
mesh
polygon
triangle
rectangle
circle
ellipse
sphere
cube
grid
axis
dimension
color
space
rgb
hsv
grayscale
binary
threshold
edge
corner
blob
contour
shape
texture
pattern
feature
descriptor
detector
extractor
matcher
tracker
estimator
classifier
regression
clustering
dimensionality
reduction
principal
component
analysis
eigenvalue
eigenvector
singular
value
decomposition
matrix
factorization
optimization
minimization
maximization
gradient
descent
stochastic
batch
momentum
learning
rate
regularization
dropout
activation
sigmoid
tanh
relu
leaky
softmax
loss
function
cross
entropy
mean
squared
error
absolute
backpropagation
forward
backward
update
weight
bias
parameter
hyperparameter
initialization
normalization
batch
layer
instance
group
residual
connection
skip
attention
transformer
recurrent
lstm
gru
convolutional
pooling
maxpool
avgpool
upsampling
transpose
dilated
depthwise
pointwise
separable
mobilenet
resnet
inception
vgg
alexnet
googlenet
efficientnet
densenet
yolo
ssd
faster
rcnn
mask
unet
psp
deeplabv3
gan
vae
autoencoder
diffusion
stable
latent
embedding
word2vec
glove
bert
gpt
transformer
tokenization
vocabulary
corpus
dataset
annotation
label
ground
truth
supervised
unsupervised
semi-supervised
self-supervised
transfer
learning
fine-tuning
pre-training
bootstrapping
augmentation
rotation
scaling
flipping
cropping
noise
blur
distortion
occlusion
evaluation
validation
testing
cross
validation
k-fold
stratified
holdout
train
test
split
metrics
accuracy
precision
recall
f1
score
confusion
matrix
roc
auc
iou
map
benchmark
baseline
state-of-the-art
improvement
ablation
study
experiment
control
variable
independent
dependent
hypothesis
theory
model
parameter
count
flops
memory
footprint
quantization
pruning
distillation
compression
acceleration
inference
serving
deployment
containerization
virtualization
orchestration
scaling
horizontal
vertical
load
balancing
failover
recovery
redundancy
reliability
availability
maintainability
scalability
extensibility
modularity
coupling
cohesion
dependency
injection
inversion
control
separation
concerns
single
responsibility
open
closed
liskov
substitution
interface
segregation
dependency
version
semantic
major
minor
patch
release
candidate
alpha
beta
stable
development
production
staging
testing
continuous
integration
deployment
delivery
pipeline
workflow
automation
scripting
tooling
environment
configuration
variable
secret
credential
authentication
authorization
encryption
security
privacy
compliance
regulation
standard
protocol
format
specification
implementation
reference
documentation
tutorial
guide
example
sample
demo
showcase
benchmark
performance
test
unit
integration
system
acceptance
regression
smoke
sanity
compatibility
interoperability
portability
platform
device
hardware
software
driver
firmware
library
framework
toolkit
sdk
api
service
microservice
monolith
distributed
centralized
hybrid
edge
cloud
on-premise
infrastructure
server
client
protocol
request
response
synchronous
asynchronous
streaming
buffering
caching
prefetching
lazy
loading
eager
evaluation
memoization
pooling
singleton
factory
builder
adapter
facade
decorator
proxy
observer
strategy
template
command
interpreter
visitor
state
mediator
chain
responsibility
composite
iterator
memento
prototype
abstract
factory
bridge
flyweight
data
structure
array
list
vector
set
map
dictionary
hash
table
tree
binary
graph
heap
stack
queue
priority
linked
doubly
circular
deque
trie
suffix
radix
b-tree
avl
red-black
spanning
directed
undirected
weighted
acyclic
algorithm
search
sort
merge
quick
heap
insertion
selection
bubble
counting
radix
bucket
shell
tim
intro
patience
tree
traversal
preorder
inorder
postorder
level-order
depth-first
breadth-first
greedy
dynamic
programming
divide
conquer
backtracking
branch
bound
heuristic
approximation
randomized
probability
statistics
distribution
normal
uniform
poisson
binomial
exponential
gaussian
bayesian
frequentist
hypothesis
testing
confidence
interval
p-value
significance
correlation
causation
regression
classification
clustering
anomaly
detection
reinforcement
learning
policy
reward
value
function
q-learning
actor
critic
model
environment
agent
state
action
observation
markov
decision
process
partially
observable
generative
discriminative
adversarial
diffusion
transformer
attention
self-attention
multi-head
positional
encoding
embedding
tokenization
vocabulary
corpus
dataset
batch
mini-batch
epoch
iteration
learning
rate
scheduler
optimizer
adam
sgd
rmsprop
adagrad
adadelta
adamw
momentum
nesterov
weight
decay
regularization
l1
l2
elastic
net
dropout
early
stopping
checkpoint
save
load
restore
transfer
learning
fine-tuning
feature
extraction
freezing
unfreezing
gradual
unfreezing
cyclical
learning
rate
warm-up
cool-down
learning
rate
finder
hyperparameter
optimization
grid
search
random
search
bayesian
optimization
genetic
algorithm
evolution
strategy
neural
architecture
search
automl
meta-learning
few-shot
one-shot
zero-shot
continual
learning
catastrophic
forgetting
knowledge
distillation
teacher
student
ensemble
bagging
boosting
stacking
voting
weighted
model
compression
quantization
pruning
sparsity
low-rank
factorization
knowledge
distillation
neural
tangent
kernel
lottery
ticket
hypothesis
batch
normalization
layer
norm
instance
norm
group
norm
weight
normalization
spectral
normalization
virtual
batch
normalization
conditional
batch
normalization
adaptive
instance
normalization
feature-wise
linear
modulation
positional
encoding
absolute
relative
rotary
alibi
activation
function
sigmoid
tanh
relu
leaky
prelu
elu
selu
gelu
swish
mish
softmax
hardmax
sparsemax
loss
function
cross
entropy
binary
categorical
sparse
kullback
leibler
divergence
mean
squared
error
mean
absolute
error
huber
log
cosh
hinge
squared
hinge
triplet
contrastive
focal
dice
tversky
lovasz
jaccard
cosine
similarity
perceptual
style
content
adversarial
cycle
consistency
reconstruction
kl
divergence
maximum
likelihood
expectation
maximization
maximum
posterior
variational
inference
monte
carlo
markov
chain
gibbs
sampling
metropolis
hastings
importance
sampling
rejection
sampling
annealed
importance
sampling
sequential
monte
carlo
particle
filter
hidden
markov
model
conditional
random
field
restricted
boltzmann
machine
deep
belief
network
energy
based
model
score
based
model
flow
based
model
autoregressive
model
transformer
encoder
decoder
encoder-decoder
attention
self-attention
cross-attention
multi-head
attention
scaled
dot-product
attention
key
query
value
residual
connection
layer
normalization
feed-forward
network
position-wise
feed-forward
network
embedding
token
positional
segment
type
mask
padding
language
model
causal
masked
bidirectional
autoregressive
autoencoding
sequence-to-sequence
text-to-text
sequence
classification
token
classification
named
entity
recognition
part-of-speech
tagging
dependency
parsing
constituency
parsing
semantic
role
labeling
coreference
resolution
sentiment
analysis
topic
modeling
text
summarization
abstractive
extractive
machine
translation
neural
machine
translation
language
modeling
masked
language
modeling
causal
language
modeling
question
answering
extractive
question
answering
generative
question
answering
multi-hop
question
answering
conversational
question
answering
dialogue
system
chatbot
conversational
agent
slot
filling
intent
classification
natural
language
inference
textual
entailment
semantic
textual
similarity
paraphrase
identification
text
generation
text-to-speech
speech-to-text
speech
recognition
speaker
verification
speaker
identification
keyword
spotting
voice
activity
detection
emotion
recognition
accent
detection
language
identification
dialect
identification
acoustic
model
language
model
pronunciation
model
lexicon
vocabulary
code
switching
multilingual
cross-lingual
transfer
learning
domain
adaptation
genre
adaptation
style
transfer
content
preservation
style
preservation
adversarial
attack
adversarial
defense
adversarial
training
adversarial
example
perturbation
natural
adversarial
example
universal
adversarial
perturbation
gradient-based
attack
score-based
attack
decision-based
attack
transfer-based
attack
ensemble-based
attack
optimization-based
attack
white-box
attack
black-box
attack
gray-box
attack
targeted
attack
untargeted
attack
evasion
attack
poisoning
attack
backdoor
attack
data
poisoning
model
poisoning
clean-label
poisoning
dirty-label
poisoning
trigger
backdoor
universal
backdoor
invisible
backdoor
neural
backdoor
feature
space
backdoor
distributed
backdoor
physical
backdoor
transformation
invariant
adversarial
training
certified
robustness
randomized
smoothing
interval
bound
propagation
lipschitz
constrained